import { PrismaClient } from '@prisma/client'

const prisma = new PrismaClient()

async function main() {
	console.log('🌱 Seeding...')

	// 1. Создание категорий
	const smartphoneCategory = await prisma.category.create({
		data: {
			name: 'Смартфоны',
			attributes: {
				create: [
					{ name: 'Диагональ экрана', type: 'number', unit: 'дюйм' },
					{ name: 'Тип матрицы', type: 'string' },
					{ name: 'Разрешение экрана', type: 'string' },
					{ name: 'Частота обновления экрана', type: 'number', unit: 'Гц' },
					{ name: 'Объем встроенной памяти', type: 'number', unit: 'ГБ' },
					{ name: 'Объем оперативной памяти', type: 'number', unit: 'ГБ' },
					{ name: 'Модель процессора', type: 'string' },
					{ name: 'Количество основных камер', type: 'number' },
					{
						name: 'Количество мегапикселей основной камеры',
						type: 'string',
						unit: 'Мп',
					},
					{
						name: 'Количество мегапикселей фронтальной камеры',
						type: 'string',
						unit: 'Мп',
					},
					{
						name: 'Ёмкость аккумулятора',
						type: 'number',
						unit: 'мА*ч',
					},
				],
			},
		},
	})

	const laptopCategory = await prisma.category.create({
		data: {
			name: 'Ноутбуки',
			attributes: {
				create: [
					{ name: 'Диагональ экрана', type: 'number', unit: 'дюйм' },
					{ name: 'Тип матрицы', type: 'string' },
					{ name: 'Разрешение экрана', type: 'string' },
					{ name: 'Частота обновления экрана', type: 'number', unit: 'Гц' },
					{ name: 'Объем встроенной памяти', type: 'number', unit: 'ГБ' },
					{ name: 'Объем оперативной памяти', type: 'number', unit: 'ГБ' },
					{ name: 'Модель процессора', type: 'string' },
					{ name: 'Вид графического ускорителя', type: 'string' },
					{ name: 'Модель встроенной видеокарты', type: 'string' },
					{ name: 'Модель дискретной видеокарты', type: 'string' },
					{
						name: 'Ёмкость аккумулятора',
						type: 'number',
						unit: 'Вт*ч',
					},
				],
			},
		},
	})

	// 2. Продукты в категории Смартфоны
	await prisma.product.createMany({
		data: [
			{
				name: 'POCO M7 Pro',
				price: 15699,
				description:
					'Мощный и стильный смартфон с большим экраном и высоким разрешением.',
				image: 'poco-m7-pro.webp',
				categoryId: smartphoneCategory.id,
				specs: {
					'Диагональ экрана': 6.67,
					'Тип матрицы': 'AMOLED',
					'Разрешение экрана': '2400x1080',
					'Частота обновления экрана': 120,
					'Объем встроенной памяти': 256,
					'Объем оперативной памяти': 8,
					'Модель процессора': 'MediaTek Dimensity 7025-Ultra',
					'Количество основных камер': 2,
					'Количество мегапикселей основной камеры': '50+2',
					'Количество мегапикселей фронтальной камеры': '20',
					'Ёмкость аккумулятора': 5110,
				},
			},
			{
				name: 'Samsung Galaxy A36',
				price: 29999,
				description: 'Стильный и надёжный смартфон с долгосрочной поддержкой.',
				image: 'samsung-galaxy-a36.webp',
				categoryId: smartphoneCategory.id,
				specs: {
					'Диагональ экрана': 6.7,
					'Тип матрицы': 'Super AMOLED',
					'Разрешение экрана': '2340x1080',
					'Частота обновления экрана': 120,
					'Объем встроенной памяти': 256,
					'Объем оперативной памяти': 8,
					'Модель процессора': 'Qualcomm Snapdragon 6 Gen 3',
					'Количество основных камер': 3,
					'Количество мегапикселей основной камеры': '50+8+5',
					'Количество мегапикселей фронтальной камеры': '12',
					'Ёмкость аккумулятора': 5000,
				},
			},
			{
				name: 'Apple iPhone 16',
				price: 111799,
				description:
					'Мощный и элегантный смартфон с улучшенной камерой, новым чипом A18 и дисплеем ProMotion нового поколения.',
				image: 'apple-iphone-16.webp',
				categoryId: smartphoneCategory.id,
				specs: {
					'Диагональ экрана': 6.1,
					'Тип матрицы': 'Super Retina XDR',
					'Разрешение экрана': '2556x1179',
					'Частота обновления экрана': 60,
					'Объем встроенной памяти': 512,
					'Объем оперативной памяти': 8,
					'Модель процессора': 'Apple A18',
					'Количество основных камер': 2,
					'Количество мегапикселей основной камеры': '48+12',
					'Количество мегапикселей фронтальной камеры': '12',
					'Ёмкость аккумулятора': 3561,
				},
			},
		],
	})

	// 3. Продукты в категории Ноутбуки
	await prisma.product.createMany({
		data: [
			{
				name: 'Honor MagicBook X 16',
				price: 41499,
				description:
					'Honor MagicBook X 16 — это тонкий и прочный ноутбук в алюминиевом корпусе с 16-дюймовым IPS-экраном и мощным процессором AMD Ryzen 5, обеспечивающий комфортную работу с ресурсоёмкими приложениями и быструю разблокировку по отпечатку пальца.',
				image: 'honor-magicbook-x-16.webp',
				categoryId: laptopCategory.id,
				specs: {
					'Диагональ экрана': 16,
					'Тип матрицы': 'IPS',
					'Разрешение экрана': '1920x1200',
					'Частота обновления экрана': 60,
					'Объем встроенной памяти': 512,
					'Объем оперативной памяти': 16,
					'Модель процессора': 'AMD Ryzen 5 7640HS',
					'Вид графического ускорителя': 'встроенный',
					'Модель встроенной видеокарты': 'AMD Radeon 760M',
					'Модель дискретной видеокарты': null,
					'Ёмкость аккумулятора': 60,
				},
			},
			{
				name: 'Acer Nitro 5 AN515-58-59UV',
				price: 74999,
				description:
					'Acer Nitro 5 AN515 — это мощный игровой ноутбук с видеокартой GeForce RTX 3050 и экраном 165 Гц, обеспечивающий плавную графику и высокую производительность в играх и ресурсоёмких задачах.',
				image: 'acer-nitro-5-an515-58-59uv.webp',
				categoryId: laptopCategory.id,
				specs: {
					'Диагональ экрана': 15.6,
					'Тип матрицы': 'IPS',
					'Разрешение экрана': '1920x1080',
					'Частота обновления экрана': 165,
					'Объем встроенной памяти': 512,
					'Объем оперативной памяти': 16,
					'Модель процессора': 'Intel Core i5-12450H',
					'Вид графического ускорителя': 'дискретный и встроенный',
					'Модель встроенной видеокарты': 'Intel UHD Graphics',
					'Модель дискретной видеокарты': 'GeForce RTX 3050 для ноутбуков',
					'Ёмкость аккумулятора': 57.5,
				},
			},
			{
				name: 'Apple MacBook Air M4',
				price: 118799,
				description:
					'Apple MacBook Air M4 — это ультратонкий и бесшумный ноутбук с мощным чипом и элегантным дизайном, идеально подходящий для работы, творчества и повседневных задач.',
				image: 'apple-macbook-air-m4.webp',
				categoryId: laptopCategory.id,
				specs: {
					'Диагональ экрана': 13.6,
					'Тип матрицы': 'IPS',
					'Разрешение экрана': '2560x1664',
					'Частота обновления экрана': 60,
					'Объем встроенной памяти': 256,
					'Объем оперативной памяти': 16,
					'Модель процессора': 'Apple M4 10-core',
					'Вид графического ускорителя': 'встроенный',
					'Модель встроенной видеокарты': 'Apple M4 10-core',
					'Модель дискретной видеокарты': null,
					'Ёмкость аккумулятора': 53.8,
				},
			},
		],
	})

	console.log('✅ Seeding completed!')
}

main()
	.catch((e) => {
		console.error('❌ Seed failed:', e)
		process.exit(1)
	})
	.finally(async () => {
		await prisma.$disconnect()
	})
